In [11]:
import pandas as pd
import numpy as np
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [14]:
obj.drop(["d","a"],inplace  = True)

In [15]:
obj

b    1.0
c    2.0
e    4.0
dtype: float64

In [16]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"], columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.drop('three', axis = 1)

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
New York   12   13    15

In [20]:
data.drop('Colorado')

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
data.drop(index = ['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data.drop(['two','four'] ,axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [25]:
data.drop(columns = ['one','four'])

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [30]:
# Create sample data with 4 rows
data = pd.DataFrame({
    'name': ['Ram', 'Sita', 'Hari', 'Gita'],
    'age': [25, 19, 35, 28],
    'city': ['Kathmandu', 'Pokhara', 'Biratnagar', 'Chitwan'],
    'col1': ['x', 'y', 'z', 'w'],   # Unwanted column
    'col2': [10, 20, 30, 40]        # Another unwanted column
})

print("Original Data:")
print(data)

Original Data:
   name  age        city col1  col2
0   Ram   25   Kathmandu    x    10
1  Sita   19     Pokhara    y    20
2  Hari   35  Biratnagar    z    30
3  Gita   28     Chitwan    w    40

In [31]:
cleaned = (data.drop(['col1', 'col2'], axis=1)
             .sort_values('age')
             .reset_index(drop=True))

In [32]:
cleaned

   name  age        city
0  Sita   19     Pokhara
1   Ram   25   Kathmandu
2  Gita   28     Chitwan
3  Hari   35  Biratnagar

In [33]:
## indexing,Slicing and Filtering

obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [38]:
# obj.loc[[0, 1]]    ## this causes errror

In [35]:
obj.iloc[[0,1]]

a    0.0
b    1.0
dtype: float64

In [37]:
obj.loc[['b','c']] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [42]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)))   # forms row and column with 0 and 2

df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [43]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=["Ohio", "Colorado", "Utah", "New York"],
columns=["one", "two", "three", "four"])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
df["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [45]:
df[1:3]   # SELECT SECOND AND FOURHT ROW

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [46]:
df< 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [47]:
df.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [48]:
df.loc[['Colorado', 'Utah']]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [50]:
type(df)  ## IT is a dataframe

pandas.core.frame.DataFrame

In [51]:
obj  = df['two']  ## it is a series object
type(obj)

pandas.core.series.Series

# Arthemetic and Data Alignment

In [49]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
    index=["a", "c", "e", "f", "g"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [54]:
s1+s2   #some of the result might come NaN i.e, Not a Number

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [53]:
d1 = pd.DataFrame([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
d2 = pd.DataFrame([-2.1, 3.6, -1.5, 4, 3.1],
    index=["a", "c", "e", "f", "g"])
d1

     0
a  7.3
c -2.5
d  3.4
e  1.5

In [55]:
d1+d2

     0
a  5.2
c  1.1
d  NaN
e  0.0
f  NaN
g  NaN

In [56]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
index=["Utah", "Ohio", "Texas", "Oregon"])

In [57]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [58]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [59]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [60]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns = list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                   columns = list('abcde'))

df2.loc[1,'b'] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [61]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [63]:
df1+df2

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   8.0
1  10.0   NaN  14.0  16.0  18.0
2  20.0  22.0  24.0  26.0  28.0
3  30.0  32.0  34.0  36.0  38.0

In [64]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   8.0
1  10.0   NaN  14.0  16.0  18.0
2  20.0  22.0  24.0  26.0  28.0
3  30.0  32.0  34.0  36.0  38.0

In [65]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
columns=list("bde"),
index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [66]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [67]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [68]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int64

In [69]:
frame +series

          b     d     e
Utah    0.0   2.0   4.0
Ohio    3.0   5.0   7.0
Texas   6.0   8.0  10.0
Oregon  9.0  11.0  13.0

In [70]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
columns=list("bde"),
index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -1.215338 -0.496245  0.535273
Ohio    0.259613  0.488209  0.464630
Texas  -0.101942 -0.335763  0.865349
Oregon -0.390067  1.882775  0.330546

In [71]:
np.abs(frame)

               b         d         e
Utah    1.215338  0.496245  0.535273
Ohio    0.259613  0.488209  0.464630
Texas   0.101942  0.335763  0.865349
Oregon  0.390067  1.882775  0.330546

In [72]:
def f1(x):
    return x.max() - x.min()

In [73]:
frame.apply(f1)

b    1.474950
d    2.379020
e    0.534803
dtype: float64

In [75]:
frame.apply(f1,axis = 1)

Utah      1.750611
Ohio      0.228596
Texas     1.201112
Oregon    2.272842
dtype: float64

In [76]:
frame.apply(f1,axis = 1)

Utah      1.750611
Ohio      0.228596
Texas     1.201112
Oregon    2.272842
dtype: float64

In [77]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min -1.215338 -0.496245  0.330546
max  0.259613  1.882775  0.865349

In [79]:
def my_format(x):
    return f"{x:.2f}"
frame.map(my_format)

            b      d     e
Utah    -1.22  -0.50  0.54
Ohio     0.26   0.49  0.46
Texas   -0.10  -0.34  0.87
Oregon  -0.39   1.88  0.33

# Sorting  and Ranking

In [80]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [81]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [82]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
index=["three", "one"],
columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [83]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [84]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [85]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [86]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [87]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [88]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [89]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [90]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [91]:
frame.rank(axis = 1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

# Summarizing and Computing Descriptive Statistics

In [92]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]],
    index=["a", "b", "c", "d"],
    columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [93]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [94]:
df.sum(axis=1) # or axis = 'columns'

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [95]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [96]:
df.sum(axis='columns', skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [97]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [98]:
df.idxmax()

one    b
two    d
dtype: object

In [99]:
df.idxmax(axis=1)

/var/folders/by/1y9dyrg52t3_69n_jld52myh0000gn/T/ipykernel_2285/2804957572.py:1: FutureWarning: The behavior of DataFrame.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [100]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [101]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000